# Carregando as bibliotecas necessárias

In [1]:
import pandas as pd

## Carregando a base de dados

In [10]:
df_countries = pd.read_csv('mapping-sql/datasets/countries.csv')

In [3]:
df_countries.head()

,id,code,name,continent,wikipedia_link,keywords
0,302672,AD,Andorra,EU,http://en.wikipedia.org/wiki/Andorra,NaN
1,302618,AE,United Arab Emirates,AS,http://en.wikipedia.org/wiki/United_Arab_Emirates,"UAE,مطارات في الإمارات العربية المتحدة"
2,302619,AF,Afghanistan,AS,http://en.wikipedia.org/wiki/Afghanistan,NaN
3,302722,AG,Antigua and Barbuda,NaN,http://en.wikipedia.org/wiki/Antigua_and_Barbuda,NaN
4,302723,AI,Anguilla,NaN,http://en.wikipedia.org/wiki/Anguilla,NaN

## Mapeando as instruções SQL em comandos PANDAS

### SELECT - Seleção de dados

#### SELECT * FROM COUNTRIES

In [4]:
df_countries

,id,code,name,continent,wikipedia_link,keywords
0,302672,AD,Andorra,EU,http://en.wikipedia.org/wiki/Andorra,NaN
1,302618,AE,United Arab Emirates,AS,http://en.wikipedia.org/wiki/United_Arab_Emirates,"UAE,مطارات في الإمارات العربية المتحدة"
2,302619,AF,Afghanistan,AS,http://en.wikipedia.org/wiki/Afghanistan,NaN
3,302722,AG,Antigua and Barbuda,NaN,http://en.wikipedia.org/wiki/Antigua_and_Barbuda,NaN
4,302723,AI,Anguilla,NaN,http://en.wikipedia.org/wiki/Anguilla,NaN
...,...,...,...,...,...,...
242,302609,YT,Mayotte,AF,http://en.wikipedia.org/wiki/Mayotte,NaN
243,302610,ZA,South Africa,AF,http://en.wikipedia.org/wiki/South_Africa,NaN
244,302611,ZM,Zambia,AF,http://en.wikipedia.org/wiki/Zambia,NaN
245,302612,ZW,Zimbabwe,AF,http://en.wikipedia.org/wiki/Zimbabwe,NaN
246,302613,ZZ,Unknown or unassigned country,AF,http://en.wikipedia.org/wiki/Unknown_or_unassi...,NaN

#### SELECT TOP(10) * FROM Countries

In [5]:
df_countries.head(10)

,id,code,name,continent,wikipedia_link,keywords
0,302672,AD,Andorra,EU,http://en.wikipedia.org/wiki/Andorra,NaN
1,302618,AE,United Arab Emirates,AS,http://en.wikipedia.org/wiki/United_Arab_Emirates,"UAE,مطارات في الإمارات العربية المتحدة"
2,302619,AF,Afghanistan,AS,http://en.wikipedia.org/wiki/Afghanistan,NaN
3,302722,AG,Antigua and Barbuda,NaN,http://en.wikipedia.org/wiki/Antigua_and_Barbuda,NaN
4,302723,AI,Anguilla,NaN,http://en.wikipedia.org/wiki/Anguilla,NaN
5,302673,AL,Albania,EU,http://en.wikipedia.org/wiki/Albania,NaN
6,302620,AM,Armenia,AS,http://en.wikipedia.org/wiki/Armenia,NaN
7,302556,AO,Angola,AF,http://en.wikipedia.org/wiki/Angola,NaN
8,302615,AQ,Antarctica,AN,http://en.wikipedia.org/wiki/Antarctica,NaN
9,302789,AR,Argentina,SA,http://en.wikipedia.org/wiki/Argentina,Aeropuertos de Argentina

#### SELECT Code FROM Countries WHERE name = 'BRAZIL'

In [7]:
df_countries[df_countries['name']=='Brazil']['code']

29    BR
Name: code, dtype: object

#### SELECT COUNT(*) FROM Countries

In [8]:
df_countries.count()

id                247
code              246
name              247
continent         206
wikipedia_link    247
keywords           91
dtype: int64

#### Selecionando dados em diversos datasets

1. Inner Join
2. Left/Right Join
3. Outer Join

#### Query para retornar todos os dados dos PRODUTOS e VENDAS

*SELECT produto.Nome, produto.Descricao, produto.Categoria, venda.Quantidade, venda.Data from Produto produto
INNER Join Venda venda ON produto.Codproduto = venda.CodProduto*

In [11]:
df_produtos = pd.read_csv('mapping-sql/datasets/produtos.csv', sep=',')
df_vendas = pd.read_csv('mapping-sql/datasets/vendas.csv', sep=',')

In [12]:
df_produtos.head()

,codproduto,nome,descricao,categoria
0,857,MacBook Air,"13 Polegadas, 8GB RAM, 250GB..",Eletrônicos e Informática

In [13]:
df_vendas.head()

   codvenda  codproduto  quantidade        data
0       124         857          15  22/09/2018

#### Utilizando a instrução MERGE

In [14]:
resultado = pd.merge(df_produtos,
                    df_vendas[['codproduto','quantidade','data']],
                     on='codproduto')

resultado.rename(columns={'quantidade': 'Qtde Vendas'}, inplace=True)
resultado.head()

,codproduto,nome,descricao,categoria,Qtde Vendas,data
0,857,MacBook Air,"13 Polegadas, 8GB RAM, 250GB..",Eletrônicos e Informática,15,22/09/2018

### UPDATE - Atualização de dados

#### Carregando a base de dados

In [15]:
df_blackfriday = pd.read_csv('mapping-sql/datasets/blackfriday.csv', error_bad_lines=False)

In [16]:
df_blackfriday.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [17]:
df_blackfriday['Marital_Status'].head(10)

0    0
1    0
2    0
3    0
4    0
5    0
6    1
7    1
8    1
9    1
Name: Marital_Status, dtype: int64

#### Utilizando o método LOC

**Sintaxe:** *dataframe.loc[< condição >, < atributos >] = valor*

#### Em SQL teriamos algo mais ou menos assim...

*UPDATE from blackfriday set Marital_Status = 'Married' WHERE Marital_Status = 1*

In [18]:
df_blackfriday.loc[df_blackfriday['Marital_Status']==1] = 'Married'

In [19]:
df_blackfriday['Marital_Status'].head(10)

0          0
1          0
2          0
3          0
4          0
5          0
6    Married
7    Married
8    Married
9    Married
Name: Marital_Status, dtype: object

#### Outro exemplo, utilizando outro atributo a partir da condição

In [20]:
df_blackfriday.loc[df_blackfriday['Marital_Status']== 'Married', 'Credit_Risk'] = 'Low'

In [21]:
df_blackfriday[['Marital_Status', 'Credit_Risk']].head(10)

  Marital_Status Credit_Risk
0              0         NaN
1              0         NaN
2              0         NaN
3              0         NaN
4              0         NaN
5              0         NaN
6        Married         Low
7        Married         Low
8        Married         Low
9        Married         Low

### INSERT - Inserção de dados

In [22]:
df_countries.head()

,id,code,name,continent,wikipedia_link,keywords
0,302672,AD,Andorra,EU,http://en.wikipedia.org/wiki/Andorra,NaN
1,302618,AE,United Arab Emirates,AS,http://en.wikipedia.org/wiki/United_Arab_Emirates,"UAE,مطارات في الإمارات العربية المتحدة"
2,302619,AF,Afghanistan,AS,http://en.wikipedia.org/wiki/Afghanistan,NaN
3,302722,AG,Antigua and Barbuda,NaN,http://en.wikipedia.org/wiki/Antigua_and_Barbuda,NaN
4,302723,AI,Anguilla,NaN,http://en.wikipedia.org/wiki/Anguilla,NaN

In [29]:
# As outras colunas serão setadas com valores nulos

df2 = pd.DataFrame({'id':[100], 'name':['França']})

In [26]:
df2

    id    name
0  100  França

In [31]:
df_countries = df_countries.append(df2, ignore_index=True, sort=False)

In [32]:
df_countries[df_countries['name']=='França']

      id code    name continent wikipedia_link keywords
246  100  NaN  França       NaN            NaN      NaN

### DELETE - Exclusão de dados

#### Excluindo o registro através do seu index

In [27]:
df_countries.drop([0, 246], inplace=True)

#### Excluindo registros usando condição como critério

In [33]:
condicao = df_countries[df_countries['name']=='França'].index
df_countries.drop(condicao, inplace=True)

In [34]:
df_countries[df_countries['name']=='França']

Empty DataFrame
Columns: [id, code, name, continent, wikipedia_link, keywords]
Index: []